[
    {
        "id":"wanted_men",
        "name":"Wanted men",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"Off the main road, southeast of Deebo's Orchard, I've stumbled across a group of sketchy looking men with familiar voices."
            },
            {
                "progress":15,
                "logText":"The sketchy looking men with familiar voices turned out to be the Aidem thieves from Sullengard. They were hiding-out in the woods."
            },
            {
                "progress":20,
                "logText":"While speaking with Defy, I've learned the he and his men have a grudge against the Thieves Guild and they want to \"hit them where it really hurts\". Whatever that means."
            },
            {
                "progress":25,
                "logText":"Defy has revealed the location of the Thieves Guild's vault of treasure - an underground storage unit accessible from the vacant house south of Fallhaven."
            },
            {
                "progress":30,
                "logText":"Defy has asked me to convince Troublemaker to let me borrow the key long enough that I can bring it back to Defy."
            },
            {
                "progress":35,
                "logText":"Defy has agreed to pay me 20 percent of the looted Thieves Guild treasure if I get the key from Troublemaker and hand it over to him."
            },
            {
                "progress":40,
                "logText":"Defy has instructed me to bring Troublemaker's key to him at their new hideout located west of the Sutdover River, where the rail tracks end."
            },
            {
                "progress":45,
                "logText":"I have talked my way into acquiring the Thieves Guild's vault key from Troublemaker, but I must return it to him quickly after I am done with it."
            },
            {
                "progress":50,
                "logText":"I told Troublemaker all that I knew about Defy, his men, and the \"Lost Traveler\" Alaric and how they hired me to help rob the Thieves Guild."
            },
            {
                "progress":55,
                "logText":"Troublemaker has asked me to help him trap Defy by providing Defy with a fake key. When Defy arrives at the secret vault, the Guild members will be waiting for him."
            },
            {
                "progress":56,
                "logText":"I gave Defy the fake version of the vault key that Troublemaker gave me. In return, Defy has given me a fake version of Troublemaker's vault key and has instructed me to return it to Troublemaker.\nDefy then told me to report back to the vault in order to collect my share of the gold. He has no idea that the key I gave him is a fake."
            },
            {
                "progress":57,
                "logText":"I have reported back to the vacant house and I met Rennik there. He informed me that the Thieves Guild has apprehended all five men and that they are now in the Guild jail.",
                "rewardExperience":19797,
                "finishesQuest":1
            },
            {
                "progress":60,
                "logText":"Defy has given me a fake version of Troublemaker's vault key and has instructed me to return it to Troublemaker. Then I should report back to the vault in order to collect my share of the gold."
            },
            {
                "progress":65,
                "logText":"I have given the fake Aidem key to Troublemaker as a replacement for the real vault key."
            },
            {
                "progress":70,
                "logText":"I reported back to Defy and he rewarded me with 25000 gold.",
                "rewardExperience":14700,
                "finishesQuest":1
            },
            {
                "progress":75,
                "logText":"I told Defy that I was keeping the key for myself and plan to loot the Thieves Guild's vault myself. A fight ensued."
            },
            {
                "progress":76,
                "logText":"I have killed Defy, his three henchmen and Alaric. I really should go back to Fallhaven and talk to Troublemaker again."
            },
            {
                "progress":77,
                "logText":"I've unlocked the hatch leading to the vault. It's time to head down."
            },
            {
                "progress":80,
                "logText":"I informed Troublemaker that Defy and his men are now dead.",
                "rewardExperience":16888,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"wicked_witch",
        "name":"A Wicked witch",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"Bela, the Fallhaven tavern keeper heard from a customer about a possible kidnapping of a girl. I should ask around town if anyone knows more."
            },
            {
                "progress":20,
                "logText":"The \"busy farmer\", in the southeastern part of Fallhaven knows something about the witch."
            },
            {
                "progress":30,
                "logText":"The \"busy farmer\" and his best friend, Addie where kept captive by the witch a very long time ago when they were just kids. He never saw Addie again."
            },
            {
                "progress":40,
                "logText":"The \"busy farmer\" told me that the witch's house is just south of Fallhaven. Covered in beautiful flowers."
            },
            {
                "progress":50,
                "logText":"After meeting Bonicksa, the wicked witch, I decided to let her live and she did likewise, but not before leaving me with a very cryptic response. Saying I was \"confident in my path\" and that \"we shall see\". I wonder what that meant?",
                "finishesQuest":1
            },
            {
                "progress":55,
                "logText":"I have attacked Bonicksa."
            },
            {
                "progress":60,
                "logText":"I killed what I thought was Bonicksa, but I quickly realized that I killed an innocent girl."
            },
            {
                "progress":65,
                "logText":"I \"killed\" Bonicksa again, only for her to reappear."
            },
            {
                "progress":70,
                "logText":"Bonicksa lives and could not be defeated. But I learned a huge life lesson.",
                "rewardExperience":1000,
                "finishesQuest":1
            },
            {
                "progress":80,
                "logText":"I discovered a young girl named Emmeline just behind the 'wicked witch's' house. The witch was really Emmeline under a spell from Bonicksa."
            },
            {
                "progress":85,
                "logText":"Emmeline asked me to get her \"a lot\" of those \"Tonics of Blood\"."
            },
            {
                "progress":90,
                "logText":"Emmeline told me to head east of the witch's house to find the undead that know about the 'Tonic of Blood'."
            },
            {
                "progress":95,
                "logText":"I gave Emmeline 25 of the \"Tonics of Blood\" that she asked for and she was then able to leave that terrible place.",
                "rewardExperience":24097,
                "finishesQuest":1
            },
            {
                "progress":96,
                "logText":"I gave Emmeline 20 of the 25 \"Tonics of Blood\" that she asked for and she was then able to leave that terrible place.",
                "rewardExperience":21085,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"sutdover_hidden",
        "name":"Sutdove_nondisplay",
        "stages":[
            {
                "progress":1,
                "logText":"PC has completed enough of  'A Wicked witch' to enable mountain teleportation crystals."
            },
            {
                "progress":2,
                "logText":"The PC has been rewarded by Rennik."
            },
            {
                "progress":7,
                "logText":"halloween"
            },
            {
                "progress":8,
                "logText":"xmas"
            }
        ]
    }
]