[
    {
        "id":"laeroth_nondisplay",
        "name":"laeroth_nondisplay",
        "showInLog":0,
        "stages":[
            {
                "progress":1,
                "logText":"island_underground2_set1"
            },
            {
                "progress":2,
                "logText":"island_underground2_set2"
            },
            {
                "progress":3,
                "logText":"Got Verigil ring"
            },
            {
                "progress":4,
                "logText":"placed ring on tomb"
            },
            {
                "progress":5,
                "logText":"Got Eyvipa candlestick"
            },
            {
                "progress":6,
                "logText":"placed candlestick on tomb"
            },
            {
                "progress":7,
                "logText":"Got Cuned's diary //obsolete,nut"
            },
            {
                "progress":8,
                "logText":"Placed diary on tomb"
            },
            {
                "progress":9,
                "logText":"Got Jerelin's seal"
            },
            {
                "progress":10,
                "logText":"Placed seal on tomb"
            },
            {
                "progress":11,
                "logText":"Got Audela's necklace"
            },
            {
                "progress":12,
                "logText":"Placed necklace on tomb"
            },
            {
                "progress":13,
                "logText":"Raised the spirit of cuned again"
            },
            {
                "progress":14,
                "logText":"Raised Jerelin again"
            },
            {
                "progress":31,
                "logText":"Opened cell 1"
            },
            {
                "progress":32,
                "logText":"Opened cell 2"
            },
            {
                "progress":33,
                "logText":"Opened cell 3"
            },
            {
                "progress":34,
                "logText":"Opened cell 4"
            },
            {
                "progress":102,
                "logText":"Inside the Laeroth barn basement, the PC has found the Mystery Laeroth key."
            },
            {
                "progress":103,
                "logText":"This is just a wrapper around the odd coin collector 65 and 66 steps, it is easier to check this one when looking for confirmation that the PC found the Coin of Prestige and the Shield of the Brave."
            },
            {
                "progress":104,
                "logText":"The PC has helped heal Forenza. This is just a wrapper around the odd coin collector quest's \"aid\" Forenza steps."
            },
            {
                "progress":105,
                "logText":"I gave Gylew the Korhald chest."
            },
            {
                "progress":106,
                "logText":"This is just a wrapper around the odd coin collector \"end\" steps as there are 4 of them, it is easier to check this one when looking for confirmation that the quest is complete."
            },
            {
                "progress":107,
                "logText":"Sold 5 bronze and 5 silver coins to the coin collector."
            },
            {
                "progress":108,
                "logText":"PC gave Forenza Gylew's key."
            },
            {
                "progress":120,
                "logText":"Jerelin grave moved"
            },
            {
                "progress":140,
                "logText":"Looted Adakin's chest."
            },
            {
                "progress":200,
                "logText":"brute_creator_in"
            },
            {
                "progress":201,
                "logText":"brute_creator_key"
            },
            {
                "progress":211,
                "logText":"centaur1 heard"
            },
            {
                "progress":212,
                "logText":"centaur2 heard"
            },
            {
                "progress":213,
                "logText":"centaur3 heard"
            }
        ]
    },
    {
        "id":"odd_coin_collector",
        "name":"The odd coin collector",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"I traded 5 of my 'mermaid coins' to Gylew for 500 gold.",
                "rewardExperience":500
            },
            {
                "progress":11,
                "logText":"I foolishly gave 5 of my 'mermaid coins' to Gylew.",
                "rewardExperience":100
            },
            {
                "progress":20,
                "logText":"I have agreed to set off to Laeroth Manor in persuit of the Korhald coins and to bring them back to Gylew."
            },
            {
                "progress":12,
                "logText":"I  sold the 10 coins that I looted from the Arulir secret room to Gylew.",
                "rewardExperience":750
            },
            {
                "progress":13,
                "logText":"I gave Gylew the 10 coins that I looted from the Arulir secret room.",
                "rewardExperience":950
            },
            {
                "progress":30,
                "logText":"In the Laeroth basement, I noticted a sign on the wall that i could not read in its entirety, but I was able make out the name 'Korhald'. This makes me wonder if this is a clue?"
            },
            {
                "progress":40,
                "logText":"In the Laeroth basement, I discovered and looted the chest containing the 'Korhald coins'.",
                "rewardExperience":1000
            },
            {
                "progress":41,
                "logText":"In the Laeroth basement, I encountered an injured man named Forenza."
            },
            {
                "progress":42,
                "logText":"I aided Forenza with an ointment for bleeding wounds.",
                "rewardExperience":1000
            },
            {
                "progress":43,
                "logText":"In the Laeroth basement, I was able to help out Forenza by giving him a bonemeal potion.",
                "rewardExperience":500
            },
            {
                "progress":44,
                "logText":"In the Laeroth basement, I was able to help out Forenza by giving him a major health potion.",
                "rewardExperience":250
            },
            {
                "progress":46,
                "logText":"In the Laeroth basement, I was able to help out Forenza by giving him a potion of health from Lodar.",
                "rewardExperience":450
            },
            {
                "progress":47,
                "logText":"In the Laeroth basement, I was able to help out Forenza by giving him a regular health potion.",
                "rewardExperience":100
            },
            {
                "progress":48,
                "logText":"In the Laeroth basement, I was able to help out Forenza by giving him a minor health potion.",
                "rewardExperience":50
            },
            {
                "progress":50,
                "logText":"I've decided to help Forenza by agreeing to get the second key from Gylew. I should go back to Gylew now. Forenza has left the Manor island and has asked that I meet him outside of Brimhaven after my \"business\" with Gylew is complete."
            },
            {
                "progress":45,
                "logText":"I have decided to attack Forenza. I should return to Gylew with the key once he is dead."
            },
            {
                "progress":60,
                "logText":"We discovered a mysterious map inside the Korhald chest and I need to follow the river going east.",
                "rewardExperience":500
            },
            {
                "progress":62,
                "logText":"I have decided to attack Gylew. I should return to Forenza with the key once he is dead."
            },
            {
                "progress":63,
                "logText":"I killed Gylew and should return to Forenza with Gylew's key."
            },
            {
                "progress":65,
                "logText":"Inside the Korhald cave, I found the Coin of Prestige and the Shield of the Brave. I should return to Forenza and show him the coin."
            },
            {
                "progress":66,
                "logText":"Inside the Korhald cave, I found the Coin of Prestige and the Shield of the Brave. I should return to Gylew and show him the coin."
            },
            {
                "progress":100,
                "logText":"I sold Gylew the Coin of Prestige and he rewarded me handsomely for it.",
                "rewardExperience":5000,
                "finishesQuest":1
            },
            {
                "progress":105,
                "logText":"I gave Gylew the Coin of Prestige and he told me that if I ever make my way to Feygrad, to seek out his family and they will 'make that shield a little bit better\". Whatever that means.",
                "rewardExperience":6000,
                "finishesQuest":1
            },
            {
                "progress":110,
                "logText":"I sold Forenza the Coin of Prestige and he rewarded me handsomely for it.",
                "rewardExperience":5000,
                "finishesQuest":1
            },
            {
                "progress":115,
                "logText":"I gave Forenza the Coin of Prestige and he told me that if I ever make my way to Brightport, to seek out his family and they will 'reward\" me. Whatever that means.",
                "rewardExperience":6000,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"laeroth_caretaker",
        "name":"Take care of the caretaker",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"I met a caretaker at Laeroth manor. He said he cannot leave because he is bound by an oath, but not one he ever gave."
            },
            {
                "progress":15,
                "logText":"The caretaker said that he feels honor bound by a pledge that his great-great grandfather made many years ago."
            },
            {
                "progress":17,
                "logText":"Moriath told me only the past lords can release him from the oath, but they are dead. He suggested I look in the library for information about how to talk to them."
            },
            {
                "progress":20,
                "logText":"I have learned the chant needed to send spirits back to their rest on the other side."
            },
            {
                "progress":30,
                "logText":"I have learned how to raise the spirits of the dead with the help of an oegyth crystal. But I also need a personal item. I should talk to Moriath again."
            },
            {
                "progress":35,
                "logText":"Moriath suggested I search the master bedroom for a personal item from the last lord, Verigil."
            },
            {
                "progress":40,
                "logText":"Verigil told me he could not release the Caretaker from his oath, because he is from the wrong branch of the family. I must talk to his uncle, Eyvipa. He has gone back to his rest."
            },
            {
                "progress":50,
                "logText":"Moriath suggested I look for an item with \"E\" engraved on it. This would have belonged to Eyvipa."
            },
            {
                "progress":60,
                "logText":"I have found an expensive looking candlestick with \"E\" engraved on it. This must have belonged to Eyvipa."
            },
            {
                "progress":70,
                "logText":"Eyvipa was angry that I woke him from his rest. He refused to help me because his father passed him over, and made his younger brother, Cuned, lord. I had to send him back to his rest with the chant \"estray inyay eacepay\"."
            },
            {
                "progress":80,
                "logText":"I found a diary that must have belonged to Cuned."
            },
            {
                "progress":90,
                "logText":"Cuned told me that Verigil is correct, and he cannot release the caretaker from his oath because he is from the wrong branch of the family. I must talk to his father, Jerelin."
            },
            {
                "progress":100,
                "logText":"After much searching I found a seal for Jerelin in an old chest. I must go back to the tomb again."
            },
            {
                "progress":110,
                "logText":"Jerelin ignored me, and went back to his resting place. I will have to ask Cuned again what to do."
            },
            {
                "progress":120,
                "logText":"Cuned told me to speak to his mother, Audela. Jerelin didn't listen to many people, but he listened to her."
            },
            {
                "progress":130,
                "logText":"I have found what appears to be a jewelry box, with \"A\" inscribed on it. It is locked though, and too heavy to move to the tomb."
            },
            {
                "progress":140,
                "logText":"I have found a key in the bedroom."
            },
            {
                "progress":150,
                "logText":"The key fitted the jewelry box! Inside I found a necklace \"With love to Audela\" written on the back."
            },
            {
                "progress":160,
                "logText":"Audela told me to talk to Jerelin again, but tell him Audela wants this done."
            },
            {
                "progress":170,
                "logText":"I spoke to Jerelin again, and told him of Audela's wishes. He told me he will reease the caretaker, but with a condition. The caretakers last act must be to move his grave away from that of his nagging wife."
            },
            {
                "progress":180,
                "logText":"I told the caretaker what he has to do to be released from the oath. He thanked me, and agreed to do it.",
                "rewardExperience":18000,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"last_lord",
        "name":"The last lord of Laeroth",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"Before I leave Laeroth, perhaps I should try to find out where the last Lord went. Maybe there are clues somewhere in the manor."
            },
            {
                "progress":15,
                "logText":"I didn't really care about where the last lord went. I left this place, and whatever happened to him didn't make any difference to me.",
                "rewardExperience":1,
                "finishesQuest":1
            },
            {
                "progress":20,
                "logText":"I searched the caretakers room, and found a letter from \"Adakin\". It says he is leaving to explore his future, but little more than that except that it mentions a chest that contains a diary and other things he could not take with him. I should look for this chest."
            },
            {
                "progress":30,
                "logText":"I have found a chest, with an inscription \"Adakin\" on the top. It is locked though, so I need to find the key. Hopefully he did not take it with him."
            },
            {
                "progress":40,
                "logText":"I have found a key that looks like it should fit Adakin's chest."
            },
            {
                "progress":50,
                "logText":"I have opened Adakin's chest. There are some useful items in here, as well as his diary. The diary has a lock though, so it seems I must find a small key that fits this lock."
            },
            {
                "progress":60,
                "logText":"I have found a jeweled key that looks like it might be for the diary. Time to try it."
            },
            {
                "progress":70,
                "logText":"The key unlocked the diary. The final entry did not really give an answer, except that he intended to go to either Nor City or Feygard, but had yet to decide which. Perhaps I will meet him some day.",
                "rewardExperience":1000,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"brute_creator",
        "name":"Brutes",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"I have met Bidro, a fisherman on the long way to Remgard. He wondered why only few people come along nowadays."
            },
            {
                "progress":20,
                "logText":"I told Bidro about the many nasty monsters along the way."
            },
            {
                "progress":30,
                "logText":"I have discovered a cave where brutes seem to pour out."
            },
            {
                "progress":35,
                "logText":"Then I have told Bidro about this cave full of brutes."
            },
            {
                "progress":40,
                "logText":"I have talked to Os, a scientist about brute matters. He has built up a brute production facility."
            },
            {
                "progress":90,
                "logText":"I told Bidro what I have learned from Os. He thanked me for this new story he could tell his wife.",
                "rewardExperience":2000,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"final_cave",
        "name":"final_cave",
        "showInLog":0,
        "stages":[
            {
                "progress":1,
                "logText":"key 1 set - sw"
            },
            {
                "progress":2,
                "logText":"key 2 set - w"
            },
            {
                "progress":3,
                "logText":"key 3 set - nw"
            },
            {
                "progress":4,
                "logText":"key 4 set - n"
            },
            {
                "progress":5,
                "logText":"key 5 set - ne"
            },
            {
                "progress":6,
                "logText":"key 6 set - e"
            },
            {
                "progress":7,
                "logText":"key 7 set - se"
            },
            {
                "progress":9,
                "logText":"9: wall down"
            },
            {
                "progress":10,
                "logText":"10: 0=Algangror 1=Jhaeld"
            },
            {
                "progress":11,
                "logText":"11: Andor talk"
            },
            {
                "progress":12,
                "logText":"12: Algangror/Jhaeld talk"
            },
            {
                "progress":99,
                "logText":"x"
            }
        ]
    },
    {
        "id":"lae_torturer",
        "name":"Shadow of the torturer",
        "showInLog":1,
        "stages":[
            {
                "progress":5,
                "logText":"In the dungeon of the mansion I found some ghosts of prisoners. One of them told me their story."
            },
            {
                "progress":10,
                "logText":"I have agreed to help the spirits in the prison be free of the prison torturer."
            },
            {
                "progress":20,
                "logText":"I didn't want to help the spirits in the prison be free of the prison torturer."
            },
            {
                "progress":25,
                "logText":"Kotheses the torturer offered to teach me his art, as he had done for Andor before."
            },
            {
                "progress":30,
                "logText":"I accepted his offer to apprentice with him."
            },
            {
                "progress":35,
                "logText":"Kotheses gave me an Oegyth crystal."
            },
            {
                "progress":40,
                "logText":"In order to imprison the released prisoners again, I should call the demon guard by throwing an Oegyth crystal into the abyss."
            },
            {
                "progress":50,
                "logText":"Kotheses scolded me because I killed his precious demons."
            },
            {
                "progress":60,
                "logText":"I declined the offer to become his apprentice."
            },
            {
                "progress":70,
                "logText":"Kotheses attacked me."
            },
            {
                "progress":80,
                "logText":"I told the prisoners that I had killed their torturer. Now they could get peace.",
                "finishesQuest":1
            },
            {
                "progress":100,
                "logText":"I have thrown an Oegyth crystal down into the abyss to call for the dark watch."
            },
            {
                "progress":110,
                "logText":"I got back the Oegyth crystal from the chief of the Demon guard."
            },
            {
                "progress":114,
                "logText":"I ordered the demons to watch over the prisoners."
            },
            {
                "progress":120,
                "logText":"I took my leave from Kotheses, who, incidentally, forgot to reclaim his Oegyth crystal."
            },
            {
                "progress":130,
                "logText":"Everything was in order when I left. The prisoners were back in their cells, and the Demon guard were on duty again.",
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"lae_centaurs",
        "name":"Not Pony Island",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"The island west of Remgard was inhabited by centaurs who were very angry about your visit. They told me to seek out their leader, Thalos. He should be in the northeast of the island."
            },
            {
                "progress":20,
                "logText":"I have met Thalos."
            },
            {
                "progress":30,
                "logText":"He ordered me to slay a foul creature that hides in a cave on the hills of Laeroth Island, because the centaurs can't enter it."
            },
            {
                "progress":110,
                "logText":"In the cave entrance I have met Algangror, who asked for help."
            },
            {
                "progress":112,
                "logText":"In a cave entrance I have met Jhaeld of Remgard, who asked for help."
            },
            {
                "progress":120,
                "logText":"A common friend would be trapped deeper in the cave and I should free him."
            },
            {
                "progress":130,
                "logText":"Down in the cave I have found my brother Andor, locked in a room with no doors or other entrances."
            },
            {
                "progress":140,
                "logText":"To open an entrance I had to find the four scrolls of elements and the three color globes. These were hidden all over the island.\nThe scrolls and globes would need to be properly placed around Andor's golden prison."
            },
            {
                "progress":150,
                "logText":"The wall opened and gave access to the interior of the room."
            },
            {
                "progress":160,
                "logText":"With an intense sound, the wall built up again. I've been locked up!"
            },
            {
                "progress":170,
                "logText":"The only way out was down a staircase, which, however, seemed to be magically secured."
            },
            {
                "progress":180,
                "logText":"The only way out was down a staircase, which, however, seemed to be magically secured."
            },
            {
                "progress":190,
                "logText":"It was no problem going downstairs, but something was wrong there."
            },
            {
                "progress":200,
                "logText":"The whole thing was just a big scam to lure me into this cave to serve Dorhantarh as dinner."
            },
            {
                "progress":210,
                "logText":"The moment I placed the Scroll of Fire on the table, it exploded. At the same time the wall opened again."
            },
            {
                "progress":300,
                "logText":"I brought the monster's heart to Thalos and told him that the danger has been averted. He was impressed and relieved at the same time."
            },
            {
                "progress":310,
                "logText":"Since then I have been a welcome guest of the centaurs.",
                "rewardExperience":10000,
                "finishesQuest":1
            }
        ]
    }
]