[
    {
        "id":"fogmonster",
        "name":"Fog in the woods",
        "showInLog":1,
        "stages":[
            {
                "progress":5,
                "logText":"You had entered a very unnatural looking fog and decided to find the source of it. Maybe you could lift the fog?"
            },
            {
                "progress":10,
                "logText":"After you chased away a fog monster, the fog suddenly dissipated."
            },
            {
                "progress":20,
                "logText":"Another fog monster guarded the footbridge to the hut. As long as there was still fog somewhere around the hut, you couldn't drive it away."
            },
            {
                "progress":30,
                "logText":"In the hut you encountered a terrifying looking witch."
            },
            {
                "progress":70,
                "logText":"You defeated the old witch in battle, so she can't create a new fog.",
                "finishesQuest":1
            },
            {
                "progress":80,
                "logText":"You were able to convince the witch Mim to keep the road clear of fog.",
                "rewardExperience":1000,
                "finishesQuest":1
            },
            {
                "progress":90,
                "logText":"You convinced the witch Mim to replace the fog with a distraction spell.",
                "rewardExperience":1000,
                "finishesQuest":1
            },
            {
                "progress":92,
                "logText":"Madame Mim gave you a bottle of her swamp water.",
                "rewardExperience":1000
            }
        ]
    },
    {
        "id":"feygard_fog",
        "name":"feygard fog",
        "showInLog":0,
        "stages":[
            {
                "progress":1,
                "logText":"1=Fog 1 has lifted"
            },
            {
                "progress":2,
                "logText":"2=Fog 2 has lifted"
            },
            {
                "progress":3,
                "logText":"3=Fog 3 has lifted"
            },
            {
                "progress":4,
                "logText":"4=Fog 4 has lifted"
            },
            {
                "progress":5,
                "logText":"5=Fog 5 has lifted"
            },
            {
                "progress":6,
                "logText":"6=Fog 1 normal"
            },
            {
                "progress":7,
                "logText":"7=Fog 1 short"
            },
            {
                "progress":8,
                "logText":"8=Fogs shortened"
            },
            {
                "progress":9,
                "logText":"9=Fogs ended"
            },
            {
                "progress":10,
                "logText":"10=Board"
            }
        ]
    },
    {
        "id":"feygard_nondisplayed",
        "name":"feygard_nondisplayed",
        "showInLog":0,
        "stages":[
            {
                "progress":1,
                "logText":"1=Stolen from offering to Elythara"
            },
            {
                "progress":2,
                "logText":"The PC threw an Oegyth Crystal down the well in Wexlow Village."
            },
            {
                "progress":3,
                "logText":"The PC has attacked Gamjee the troll under the village of Wexlow without knowing that Gamjee has those villagers held captive."
            },
            {
                "progress":4,
                "logText":"The PC has attacked Gamjee the troll under the village of Wexlow after learning that Gamjee has those villagers held captive."
            },
            {
                "progress":5,
                "logText":"The PC has attacked Gamjee the troll under the village of Wexlow."
            },
            {
                "progress":6,
                "logText":"Gamjee, the troll under the village of Wexlow has sent the villager back to Wexlow."
            },
            {
                "progress":7,
                "logText":"PC gave Godwin, a villager from Wexlow, his lost ring. [wrapper for 13, 14, 15]"
            },
            {
                "progress":13,
                "logText":"PC gave Godwin, a villager from Wexlow, his lost ring for free.",
                "rewardExperience":1000
            },
            {
                "progress":14,
                "logText":"PC gave Godwin, a villager from Wexlow, his lost ring for 2k gold.",
                "rewardExperience":100
            },
            {
                "progress":15,
                "logText":"PC gave Godwin, a villager from Wexlow, his lost ring for 3k gold.",
                "rewardExperience":1
            },
            {
                "progress":8,
                "logText":"PC learns that Rosmara sells fruits and vegetables"
            },
            {
                "progress":9,
                "logText":"PC can sleep in Wexlow Village."
            },
            {
                "progress":10,
                "logText":"PC has learned what the beekeeper, Leofric does for work."
            },
            {
                "progress":11,
                "logText":"In Wexlow Village, the PC has learned that there are missing residents."
            },
            {
                "progress":20,
                "logText":"20=Road to Feygard closed (wayto_feygard_duleian_2)"
            },
            {
                "progress":12,
                "logText":"PC is not being patient while waiting for the Feydelight to be cooked."
            },
            {
                "progress":30,
                "logText":"boat0 clear"
            },
            {
                "progress":31,
                "logText":"boat0 sunk"
            },
            {
                "progress":32,
                "logText":"boat0 save"
            },
            {
                "progress":60,
                "logText":"60=talked to Arthamyr"
            },
            {
                "progress":61,
                "logText":"61=ladder placed"
            },
            {
                "progress":62,
                "logText":"62=tried window"
            },
            {
                "progress":63,
                "logText":"63=church window unlocked"
            },
            {
                "progress":65,
                "logText":"65=jewel taken"
            },
            {
                "progress":66,
                "logText":"66=passed window towards tailor"
            },
            {
                "progress":68,
                "logText":"68=seen"
            },
            {
                "progress":69,
                "logText":"69=closed"
            },
            {
                "progress":71,
                "logText":"71=ladder place 1"
            },
            {
                "progress":72,
                "logText":"72=ladder place 2"
            },
            {
                "progress":73,
                "logText":"73=windows church unlocked from inside"
            },
            {
                "progress":80,
                "logText":"80=Path open"
            },
            {
                "progress":81,
                "logText":"81=Godoe in the south"
            },
            {
                "progress":90,
                "logText":"90=Ravine blocked"
            },
            {
                "progress":91,
                "logText":"91=Ravine outlets blocked"
            },
            {
                "progress":92,
                "logText":"92=Ravine free"
            }
        ]
    },
    {
        "id":"tobby",
        "name":"Sobby's Trail",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"On the road to Feygard I have met a boy named Tobby. He is looking for his brother Sobby."
            },
            {
                "progress":20,
                "logText":"I have promised to help Tobby get past the kobolds to the south."
            },
            {
                "progress":21,
                "logText":"I have killed the rat in Tobby's garden.",
                "rewardExperience":30
            },
            {
                "progress":22,
                "logText":"I gave Tobby a loaf of bread for his father.",
                "rewardExperience":30
            },
            {
                "progress":23,
                "logText":"Tobby has followed me to the beginning of the ravine with the kobolds."
            },
            {
                "progress":24,
                "logText":"Tobby has made it through the ravine."
            },
            {
                "progress":25,
                "logText":"Tobby followed me further to the south."
            },
            {
                "progress":30,
                "logText":"I have attacked poor Tobby, but he ran away. Now he will never find his brother.",
                "finishesQuest":1
            },
            {
                "progress":40,
                "logText":"We have parted. Tobby was sure now to find his brother.",
                "rewardExperience":1500,
                "finishesQuest":1
            },
            {
                "progress":50,
                "logText":"I have met Tobby again, together with Sobby in the little village in the woods."
            }
        ]
    },
    {
        "id":"echoes_of_enchantment",
        "name":"Echoes of enchantment",
        "showInLog":1,
        "stages":[
            {
                "progress":1,
                "logText":"At the Wexlow well, I angered something evil and powerful (named Gamjee, I think) to the point that it pulled me down into the well. I've landed at the well's bottom severly injured, but alive.",
                "rewardExperience":500
            },
            {
                "progress":2,
                "logText":"After I landed with a thud at the bottom of the well and being concussed, I began to hear sounds off in the distance. Were they voices? Were they even real? Maybe a symptom of the concussion perhaps?"
            },
            {
                "progress":3,
                "logText":"After I landed with a thud at the bottom of the well and being concussed, I began to hear sounds off in the distance. Were they voices? Were they even real? Are they the voices of something more sinister?"
            },
            {
                "progress":4,
                "logText":"The voices I thought I heard earlier seem to be persistent and seemed to be getting louder. It was hard to tell if they're real or just a figment of my imagination."
            },
            {
                "progress":5,
                "logText":"Deep inside the well's tunnels, I found eight people being held captive inside a very deep pit."
            },
            {
                "progress":6,
                "logText":"I learned that these people are held captive by a troll and they need me to find a way to free them."
            },
            {
                "progress":7,
                "logText":"I met the troll named Gamjee and listened to what he had to say."
            },
            {
                "progress":8,
                "logText":"In an attempt to help Gamjee and the villagers, I have facilitated a conversation between Gamjee and one of the villagers."
            },
            {
                "progress":9,
                "logText":"I killed Gamjee and in doing so, I found a rope that I think might be helpful in freeing those people in that pit.",
                "rewardExperience":1200
            },
            {
                "progress":11,
                "logText":"I killed Gamjee and in doing so, I realized that I really should go investigate the voices I heard earlier.",
                "rewardExperience":1000
            },
            {
                "progress":10,
                "logText":"The villagers have been freed. I should visit them back in their village of Wexlow."
            },
            {
                "progress":12,
                "logText":"The villagers and Gamjee agreed to a schedule for using the well, ensuring everyone has access to water without conflict. But the villagers are still in the pit.",
                "rewardExperience":2000
            },
            {
                "progress":13,
                "logText":"After the villagers and Gamjee agreed to a compromise, Gamjee gave me a rope and instructed me to use it to free the remaining villagers in the pit."
            },
            {
                "progress":14,
                "logText":"I've visited the people of Wexlow Village after they made it home. They are happy to sleep in their own beds now.",
                "rewardExperience":500,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"feygard_delicacy",
        "name":"A Feygard delicacy",
        "showInLog":1,
        "stages":[
            {
                "progress":1,
                "logText":"Philippa, one of the lovely Feygard loyalist ladies from Wexlow that I rescued from Gamjee the troll has informed me that she is a master baker."
            },
            {
                "progress":2,
                "logText":"Philippa has educated me about what a \"Feydelight\" is."
            },
            {
                "progress":3,
                "logText":"In return for my helping to rescue Philippa, she's stated that she could make a \"Feydelight\" for me if I provide her with all of the ingredients necessary to bake one."
            },
            {
                "progress":4,
                "logText":"I need to find dough, two eggs, wine, butter, honey and five Feygard fig fruits. I can find the figs in Feygard, but maybe I could find some along the Duleian Road too?"
            },
            {
                "progress":5,
                "logText":"She told me that I can find the dough in Brightport or Feygard, but I could find a baker in just about any town."
            },
            {
                "progress":6,
                "logText":"Philippa told me that I can get honey from a beekeeper. But where to find one?"
            },
            {
                "progress":7,
                "logText":"I gave Philippa all the ingredients needed to bake the Feydelight. Now I just need to come back later."
            },
            {
                "progress":8,
                "logText":"I have received my Feydelight from Philippa. ",
                "rewardExperience":5049,
                "finishesQuest":1
            }
        ]
    }
]