[
    {
        "id":"sullengard_hidden",
        "name":"sullengard_nondisplay",
        "stages":[
            {
                "progress":1,
                "logText":"bought Sullengard bed"
            },
            {
                "progress":101,
                "logText":"Pat or Tickle baby's tummy.",
                "rewardExperience":100
            },
            {
                "progress":2,
                "logText":"The player has seen the tavern's menu"
            },
            {
                "progress":3,
                "logText":"I need to leave the Sullengard tavern"
            },
            {
                "progress":4,
                "logText":"The golden jackal has spawned."
            },
            {
                "progress":5,
                "logText":"Picked poisonous mushroom in sullengard_woods14"
            },
            {
                "progress":6,
                "logText":"sullengard6_replace_below"
            },
            {
                "progress":7,
                "logText":"6=sullengard6_replace_above"
            },
            {
                "progress":8,
                "logText":"sullengard5_replace_below"
            },
            {
                "progress":9,
                "logText":"sullengard5_replace_above"
            },
            {
                "progress":10,
                "logText":"sullengard7_replace_below"
            },
            {
                "progress":11,
                "logText":"sullengard7_replace_above"
            },
            {
                "progress":12,
                "logText":"sullengard9_replace_below"
            },
            {
                "progress":13,
                "logText":"sullengard9_replace_above"
            },
            {
                "progress":14,
                "logText":"sullengard10_replace_below"
            },
            {
                "progress":15,
                "logText":"sullengard10_replace_above"
            },
            {
                "progress":16,
                "logText":"Player has talked with Hadena."
            },
            {
                "progress":17,
                "logText":"Player is helping Grazia cross the bridge."
            },
            {
                "progress":18,
                "logText":"Player has helped Grazia cross the bridge.",
                "rewardExperience":200
            },
            {
                "progress":19,
                "logText":"The player has been to Sullengard."
            },
            {
                "progress":100,
                "logText":"I successfully lifted up the pitchfork from the haystack."
            },
            {
                "progress":500,
                "logText":"Key: (Never true condition)"
            },
            {
                "progress":20,
                "logText":"Nimael is preparring the Gloriosa soup."
            },
            {
                "progress":21,
                "logText":"Nimael has finished the preperation of the Gloriosa soup."
            },
            {
                "progress":22,
                "logText":"Player has gained the Gloriosa soup."
            },
            {
                "progress":23,
                "logText":"The PC has asked the 'three drinking brothers' if they have seen or know anything about the armory theft."
            },
            {
                "progress":24,
                "logText":"The PC has asked Lamberta if she had seen or knew anything about the armory theft."
            },
            {
                "progress":25,
                "logText":"The PC has asked Mayor Ale  if he had seen or knew anything about the armory theft."
            },
            {
                "progress":26,
                "logText":"The PC listen to the entire argument between Valentina and Mikhail."
            },
            {
                "progress":27,
                "logText":"The PC has admired the magnificent trees of the Sullengard forest."
            },
            {
                "progress":28,
                "logText":"Umar gave player a 1,000 gold coins as a financial contribution from Thieves Guild."
            },
            {
                "progress":29,
                "logText":"The PC is south of the ravine bridge."
            },
            {
                "progress":30,
                "logText":"The promised share has been restored."
            },
            {
                "progress":31,
                "logText":"You met a \"big\" cat in Sullengard."
            },
            {
                "progress":32,
                "logText":"The PC has bribed Tharwyn."
            },
            {
                "progress":33,
                "logText":"haunted_cemetery1_default_gp"
            },
            {
                "progress":34,
                "logText":"haunted_cemetery1_walkable_gp"
            },
            {
                "progress":35,
                "logText":"haunted_cemetery1_walkable"
            }
        ]
    },
    {
        "id":"deebo_orchard_hth",
        "name":"Hunting the hunter",
        "showInLog":1,
        "stages":[
            {
                "progress":0,
                "logText":"Deebo, the apple orchard farmer northeast of Sullengard informed me of a Golden jackal that is wreaking havoc in his orchard."
            },
            {
                "progress":10,
                "logText":"I accepted the challenge of tracking down the Golden jackal and bringing back proof to Deebo that I have killed it."
            },
            {
                "progress":40,
                "logText":"I killed the Golden jackal. I need to return to Deebo with the Golden jackal's fur as proof that I've killed it."
            },
            {
                "progress":50,
                "logText":"I returned to Deebo with the killed the Golden jackal's fur as proof that I had killed it. He was now willing to trade with me.",
                "rewardExperience":10000,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"deebo_orchard_ght",
        "name":"Getting home on time",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"Hadena needed my help to get her husband Ainsley home on time."
            },
            {
                "progress":20,
                "logText":"I agreed to help Hadena with getting her husband Ainsley home on time. He was working at Deebo's Orchard located southwest of their cabin."
            },
            {
                "progress":25,
                "logText":"Due to the vast distance to Loneford and the monsters that he would encounter along the way, Ainsley has asked me to go to Loneford and get him a new pitchfork."
            },
            {
                "progress":30,
                "logText":"Throthaus wanted me to pull out his pitchfork from the haystack to prove that I'm a son of a farmer."
            },
            {
                "progress":40,
                "logText":"I successfully pulled out the pitchfork. It's time to visit Ainsley again working in Deebo's Orchard in Sullengard."
            },
            {
                "progress":50,
                "logText":"I gave Ainsley the new pitchfork. I should tell Hadena about this."
            },
            {
                "progress":60,
                "logText":"Hadena was so grateful to me for helping them.",
                "rewardExperience":5000,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"sullengard_pond_safety",
        "name":"Pond safety",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"Nanette was troubled that her pond is unsafe because of the monsters that emerged in the pond. "
            },
            {
                "progress":20,
                "logText":"I accepted her request to clear out the monsters in her pond area so that she could enjoy the pond again."
            },
            {
                "progress":30,
                "logText":"I have now cleared the pond area. Nanette told me that I should talk to Kaelwea, the priest of Sullengard, to see if he has some information about the cause of the monster's appearance in the pond area."
            },
            {
                "progress":40,
                "logText":"The priest Kaelwea told me a story about his strange experience same as Nanette's experience in the pond area. I should better tell her the moral of the story."
            },
            {
                "progress":50,
                "logText":"I told Nanette the moral of the story. She had already learned from her mistake and she promised never to do it again just to release her anger issue against the unfair taxes of Feygard.",
                "rewardExperience":2000,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"sullengard_recover_items",
        "name":"Recovering stolen property",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"I've agreed to help the armour shop owner, Zaccheria investigate the theft of his shop's entire inventory."
            },
            {
                "progress":20,
                "logText":"Zaccheria suggested that I should start my investigation by speaking with Gaelian from the Briwerra family."
            },
            {
                "progress":30,
                "logText":"I spoke with Gaelian from the Briwerra family and I suspect that he had nothing to do with this crime."
            },
            {
                "progress":40,
                "logText":"I spoke with Prowling Arantxa, a thief in the Sullengard tavern basement and she informed me that the 'lost traveler' recently tried to sell her some items that she recgonized as belonging to Zaccheria.\nI should speak with the 'lost traveler'."
            },
            {
                "progress":50,
                "logText":"I had paid the 'lost traveler' in exchange for the location of Zaccheria's stolen items. He told me that he had hidden them on the eastern boundaries of town."
            },
            {
                "progress":60,
                "logText":"I found the stolen items and should return to Zaccheria with them."
            },
            {
                "progress":70,
                "logText":"Zaccheria was very happy that I was able to return his items to him. He paid me a very nice reward in gold.",
                "rewardExperience":3800,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"beer_bootlegging",
        "name":"Beer Bootlegging",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"I've agreed to help the Feygard patrol captain investigate why there is so much beer on the Foaming flask tavern property."
            },
            {
                "progress":20,
                "logText":"After bribing Torilo, the owner of the Foaming flask, he stated that he and other tavern owners had a 'business agreement' with a group of 'distributors'. He suggested that I ask other tavern owners for more information."
            },
            {
                "progress":30,
                "logText":"After bribing Tharwyn, the owner of the Vilegard tavern, he stated as part of his 'business agreement', Dunla, the local thief, is one of his 'distributors'. He suggested that I talk to him."
            },
            {
                "progress":40,
                "logText":"Dunla, the thief in Vilegard instructed me to speak with Farrick if I want to learn more about the tavern owner's 'business agreement' with their 'distributors'."
            },
            {
                "progress":50,
                "logText":"Farrik told me that the beer is coming from Sullengard. I really should go there next."
            },
            {
                "progress":60,
                "logText":"To earn his trust, Mayor Ale has asked that I deliver his letter to Kealwea, the Sullengard priest."
            },
            {
                "progress":70,
                "logText":"I have done what Mayor Ale has asked of me as I have delivered his letter. I should now return to him."
            },
            {
                "progress":80,
                "logText":"Mayor Ale has explained everything to me about the 'business agreement' with the Thieves guild. I should head back to the Foaming flask tavern and speak with the captain."
            },
            {
                "progress":90,
                "logText":"I informed the guard captain at the Foaming flask tavern all about the beer bootlegging operation.",
                "rewardExperience":7128,
                "finishesQuest":1
            },
            {
                "progress":100,
                "logText":"I informed the guard captain at the Foaming flask tavern that the beer was being distributed by the Thieves guild.",
                "rewardExperience":5109,
                "finishesQuest":1
            },
            {
                "progress":110,
                "logText":"I informed the guard captain at the Foaming flask tavern that Sullengard was responsible for brewing the beer.",
                "rewardExperience":5109,
                "finishesQuest":1
            },
            {
                "progress":120,
                "logText":"I lied to the guard captain at the Foaming flask tavern and told him nothing about the beer bootlegging operation.",
                "rewardExperience":3900,
                "finishesQuest":1
            }
        ]
    }
]